9/data/attachments/e6abb2a2fa752399.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>David_wait_Friend_25416_9</nif:username>
            <nif:friendToBeRequested>soap_friends_fab22856-611d-4f4b-9475-f7710b7ccd0a</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>